Revit 2027 API
InternalOrigin.SharedPosition Property
 The position of the InternalOrigin relative to the active ProjectLocation set for the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ SharedPosition { get; }
Public ReadOnly Property SharedPosition As XYZ
	Get
public:
property XYZ^ SharedPosition {
	XYZ^ get ();
}
member SharedPosition : XYZ with get
Property Value
XYZ
See Also
Reference
InternalOrigin Class
Autodesk.Revit.DB Namespace